{"config": [{"config": {"padding": "same", "kernel_size": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dtype": "float32", "filters": 16, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 128, 128, 3], "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "trainable": true, "name": "conv2d_73", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_73", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_71", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_71", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"padding": "same", "kernel_size": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 32, "activation": "linear", "use_bias": true, "name": "conv2d_74", "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_74", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_72", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_72", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"padding": "same", "kernel_size": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 64, "activation": "linear", "use_bias": true, "name": "conv2d_75", "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_75", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_73", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_73", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "global_average_pooling2d_24", "data_format": "channels_last", "trainable": true}, "class_name": "GlobalAveragePooling2D"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "use_bias": true, "name": "dense_33", "bias_constraint": null, "units": 30, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_74", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "use_bias": true, "name": "dense_34", "bias_constraint": null, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "softmax", "use_bias": true, "name": "dense_35", "bias_constraint": null, "units": 4, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6"}