{"keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "dtype": "float32", "activation": "linear", "batch_input_shape": [null, 128, 128, 3], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "filters": 16, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "name": "conv2d_1", "bias_constraint": null, "padding": "same", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [2, 2], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "filters": 32, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "name": "conv2d_2", "bias_constraint": null, "padding": "same", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [2, 2], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "filters": 64, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "name": "conv2d_3", "bias_constraint": null, "padding": "same", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.2, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [2, 2], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "filters": 64, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "name": "conv2d_4", "bias_constraint": null, "padding": "same", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_4", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.2, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 256, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 128, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 32, "trainable": true, "kernel_regularizer": null, "name": "dense_3", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 8, "trainable": true, "kernel_regularizer": null, "name": "dense_4", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 4, "trainable": true, "kernel_regularizer": null, "name": "dense_5", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null}}]}